_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиВФорматеГектор5D.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ОбменДаннымиВФорматеГектор5D</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СметнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьПоВнешнейБазе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьПоКорпоративнойБазе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СметноНормативнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиВФорматеГектор5D/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СметнаяПрограмма = Справочники.СМ_СметныеПрограммы.Гектор;
	Объект.Организация		= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнаяОрганизация");
	Объект.Район            = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнойРайон");	
	Объект.Стройка			= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнаяСтройка");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 					= Ложь;
	Режим 									= РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла 					= Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла 		= "";
	ДиалогОткрытияФайла.Фильтр 				= "Смета(*.xml)|*.xml";
	ДиалогОткрытияФайла.МножественныйВыбор 	= Ложь;
	ДиалогОткрытияФайла.Заголовок 			= НСтр("ru='Выберите файл'");
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоВнешнейБазеПриИзменении(Элемент)
	
	Объект.ОбновитьПоКорпоративнойБазе = НЕ Объект.ОбновитьПоВнешнейБазе;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоКорпоративнойБазеПриИзменении(Элемент)
	
	Объект.ОбновитьПоВнешнейБазе = НЕ Объект.ОбновитьПоКорпоративнойБазе;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	// ОбычнаяЗагрузка
	#Если Не ВебКлиент Тогда
		Если Не ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
			ПоказатьПредупреждение(,НСтр("ru='Не выбран файл для загрузки!'"));
			Возврат;
		КонецЕсли;
		ДвоичныеДанные 				= Новый ДвоичныеДанные(Объект.ПутьКФайлу);
		АдресВременногоХранилища 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		ЗагрузитьНаСервере(АдресВременногоХранилища);
		Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
			Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Обработка.СМ_ДеревоСмет.Форма.ФормаУпр" Тогда
				ЭтаФорма.ВладелецФормы.Элементы.СписокОбъектыСтроительства.Обновить()
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	#Если ВебКлиент Тогда
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
			АдресВременногоХранилищаФайла 	= "";
			ИмяФайла 						= "";
			Оповещение 						= Новый ОписаниеОповещения("ПродолжитьЗагрузкуВеб", ЭтаФорма);
			НачатьПомещениеФайла(Оповещение,АдресВременногоХранилищаФайла,ИмяФайла,Истина,ЭтаФорма.УникальныйИдентификатор); 
		КонецЕсли;
	#КонецЕсли
	
	Оповестить("ОбновитьДеревоСмет");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРегламент(Команда)
	
	ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьВыполнениеЗадания",1,Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДлительныеОперации

&НаКлиенте
Процедура Подключаемый_ЗапуститьВыполнениеЗадания()
	
	СтатусВозврата = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран файл для загрузки!'"));
		СтатусВозврата = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена Организация!'"));
		СтатусВозврата = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Стройка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена Стройка!'"));
		СтатусВозврата = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СметнаяПрограмма) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена Сметная программа!'"));
		СтатусВозврата = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СметноНормативнаяБаза) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена Сметно-нормативная база!'"));
		СтатусВозврата = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Район) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен Район!'"));
		СтатусВозврата = Истина;
	КонецЕсли;
	
	Если СтатусВозврата Тогда
		Возврат;
	КонецЕсли;
	
	Результат 				= ЗапуститьЗаданиеДокументы();	
	ИдентификаторЗадания 	= Результат.ИдентификаторЗадания;
	АдресХранилища 		 	= Результат.АдресРезультата;	
	
	Если Результат.Статус = "Выполнено" Тогда
		УдалитьФайлыРегистра();
		ОбработкаРезультатаКлиент();
		Оповестить("ОбновитьДеревоСмет");
	Иначе
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",1,Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Результат.ИдентификаторЗадания);
	КонецЕсли;  	
	
	//Если Результат.ЗаданиеВыполнено Тогда
	//	УдалитьФайлыРегистра();
	//	ОбработкаРезультатаКлиент();
	//	Оповестить("ОбновитьДеревоСмет");
	//Иначе
	//	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	//	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",1,Истина);
	//	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Результат.ИдентификаторЗадания);
	//КонецЕсли;  		
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				УдалитьФайлыРегистра();
				ОбработкаРезультатаКлиент();
				Оповестить("ОбновитьДеревоСмет");
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",ПараметрыОбработчикаОжидания.ТекущийИнтервал,Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ЗаписатьИсключениеНаСервере(ПредставлениеОшибки);
		ПоказатьПредупреждение(,НСтр("ru='Произошла ошибка. Подробности в журнале регистрации.'"));
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИсключениеНаСервере(Знач ПредставлениеОшибки)
	
	Событие = НСтр("ru = 'Ошибка в задании'");
	ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ПредставлениеОшибки);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьЗаданиеДокументы()

	ДвоичныеДанные 				= Новый ДвоичныеДанные(Объект.ПутьКФайлу);
	АдресВременногоХранилища 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//ЗагрузитьНаСервере(АдресВременногоХранилища);
	//Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
	//	Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Обработка.СМ_ДеревоСмет.Форма.ФормаУпр" Тогда
	//		ЭтаФорма.ВладелецФормы.Элементы.СписокОбъектыСтроительства.Обновить()
	//	КонецЕсли;
	//КонецЕсли;
	
	Запись 			= РегистрыСведений.СМ_Файлы.СоздатьМенеджерЗаписи();
	Запись.ИмяФайла = Объект.ПутьКФайлу;
	Запись.Файл 	= Новый ХранилищеЗначения(ПолучитьИЗВременногоХранилища(АдресВременногоХранилища));
	Запись.Записать();

	СтруктураПараметров = ПолучитьСтруктуруПараметров();
	
	Возврат Обработки.СМ_ОбменДаннымиВФорматеГектор5D.ЗапуститьСозданиеДокументовРегламент(СтруктураПараметров);
	
КонецФункции

&НаСервере
Процедура УдалитьФайлыРегистра()
	
	// Удаление файла из регистра
	Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",Объект.ПутьКФайлу)); 
	Запись.Следующий();
	Запись.ПолучитьМенеджерЗаписи().Удалить();
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ОбработкаРезультатаКлиент()
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Запись сообщений в журнал регистрации
	Если РезультатВыполнения.Свойство("МассивСообщений") Тогда
		Для Каждого ТекСообщение Из РезультатВыполнения.МассивСообщений Цикл
			Событие = НСтр("ru = 'Загрузка Гектор 5D'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие,Ложь,ТекСообщение);
		КонецЦикла;
	КонецЕсли;	
	
	// Обновление по ВНБ
	Если РезультатВыполнения.Свойство("МассивПозиций") Тогда
		Если Объект.ОбновитьПоВнешнейБазе Тогда
			Для Каждого ТекПозиция Из РезультатВыполнения.МассивПозиций Цикл
				СМ_СметаКлиент.ОбновитьЗагружаемыеПозицииПоНормативнойБазе(РезультатВыполнения.МассивПозиций);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документы сформированы.'"));
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗагрузитьНаСервере(АдресВременногоХранилища)
	
	Запись 			= РегистрыСведений.СМ_Файлы.СоздатьМенеджерЗаписи();
	Запись.ИмяФайла = Объект.ПутьКФайлу;
	Запись.Файл 	= Новый ХранилищеЗначения(ПолучитьИЗВременногоХранилища(АдресВременногоХранилища));
	Запись.Записать();

//	ОбъектДляСервера = РеквизитФормыВЗначение("Объект");
//	ОбъектДляСервера.ПрочитатьНаСервере(Объект.ПутьКФайлу);

	СтруктураПараметров = ПолучитьСтруктуруПараметров();
	Обработки.СМ_ОбменДаннымиВФорматеГектор5D.ЗапуститьСозданиеДокументов(СтруктураПараметров);
	
	Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",Объект.ПутьКФайлу)); 
	Запись.Следующий();
	Запись.ПолучитьМенеджерЗаписи().Удалить();

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПутьКФайлу",Объект.ПутьКФайлу);
	СтруктураПараметров.Вставить("Организация",Объект.Организация);
	СтруктураПараметров.Вставить("Стройка",Объект.Стройка);
	СтруктураПараметров.Вставить("СметнаяПрограмма",Объект.СметнаяПрограмма);
	СтруктураПараметров.Вставить("СметноНормативнаяБаза",Объект.СметноНормативнаяБаза);
	СтруктураПараметров.Вставить("Район",Объект.Район);
	СтруктураПараметров.Вставить("ОбновитьПоВнешнейБазе",Объект.ОбновитьПоВнешнейБазе);
	СтруктураПараметров.Вставить("ОбновитьПоКорпоративнойБазе",Объект.ОбновитьПоКорпоративнойБазе);
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти
